WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Each element is 2 bytes
  userBufElements = adcBufSzBytes/2;

  // Must have at least 1 entry per gpio
  if(gpioCount < userBufElements)
  {
    syslog(1, "%s@%d-Error:gpioCount:%lu < userBufElements:%lu\n",
              __FILE__, __LINE__, gpioCount, userBufElements);
    return -EINVAL;   // Invalid argument
  }

  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for matching port/pin in the list
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to the ADC
    }

    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
                  (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  // Will the number of GPIOs exactly fill the provided buffer?
  if(gpioCount % userBufElements != 0)
  {
    // Don't allow empty buffer slots as it's likely the user made an unintended error.
    syslog(1, "%s@%d-Error:buffer size and the number of GPIOs not multiple.\n",
                __FILE__, __LINE__);
    return -EINVAL;   // Invalid argument
  }

  // Populate global values
  _gpioList = gpioList;
  _gpioTransferCount = gpioCount;
  _userDataBuf = userDataBuf;
  _adcBufSzBytes = adcBufSzBytes;

  // Signaling semaphore
  sem_init(&_waitTillDoneSem, 0, 0);
  sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

  // Do before configuration
  // DON'T FREE the buffer's address as it's part of the DMA configuration
  _dmaDataBuf = kmm_malloc(_adcBufSzBytes);
  if(_dmaDataBuf == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Buffer space not available\n",
                __FILE__, __LINE__);
    return -ENOMEM;   // Out of memory
  }

  meadow_adc_initialize_dma();

  return OK;
}

// //=========================================================
// // Calling this function will free all the allocations and configuration that
// // the current active configuration has used.
// int meadow_adc_dispose_of_active_config()
// {
//   if(! _meadowAdcInit)
//   {
//     syslog(LOG_ERR, "%s@%d-Error:There is no active ADC configuration.\n",
//               __FILE__, __LINE__);
//     return -EPERM;    // Operation not permitted
//   }

//   // The active configuration must have an active DMA handle from the Nuttx
//   // DMA configuration call.
//   if(_dmaHandle != NULL)
//   {
//     stm32_dmastop(_dmaHandle);
//     stm32_dmafree(_dmaHandle); 
//   }

//   if(_dmaDataBuf != NULL)
//   {
//     free(_dmaDataBuf);
//   }
 
//   return OK;
// }

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
// See http://efton.sk/STM32/STM32_VREF.pdf for more details.
int meadow_adc_read_temp_vbat(uint16_t *batteryVoltage,
          uint16_t *TemperatureValue)
{
  int ret;
  uint16_t rawBatteryMeasurement;
  uint16_t rawTempMeasurement;

  // This call must be first because it reads the internal reference value
  // which is needed to derived the most accurate values
  ret = meadow_adc_read_internal_temp_vref(&rawTempMeasurement);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Temperature Conversion Error. ret:%d\n", ret);
    return ret;
  }

  // From data sheet, temperatures calibration values were read at 30 and 110
  // degrees Celcius
  uint16_t tempCal30 = 30;      // Calibration temperature 1 in DegC
  uint16_t tempCal110 = 110;    // Calibration temperature 2 in DegC

  // Get the calibration values
  uint16_t valRefInt =  *MEADOW_ADC_VREFINT_CAL_ADDR;
  uint16_t valCal30 =  *MEADOW_ADC_TEMPSENSOR_CAL110_ADDR;
  uint16_t valCal110 =  *MEADOW_ADC_TEMPSENSOR_CAL30_ADDR;

  // The raw temperature measurement value 0-4095 needs to be processed.
  // Much of the following information is found in the STM32F7 data sheet.
  // tempCal30 = 30 (degC), tempCal110 = 110 (degC), adcRawTemp is
  // the ADC value read, Vrefint is the value read from internal memory
  // as reference calibration source, valCal30 is the calibration value
  // (30 degC) and valCal110 (110 degC) and adcIntVal is the ADC value from
  // the internal voltage reference.
  int finalTemp = (tempCal30 + (tempCal110 - tempCal30) * \
            (rawTempMeasurement * valRefInt - valCal30 * _Vrefint) / \
            (_Vrefint * (valCal110 - valCal30)));

  syslog(1, "-->> Final Temperature:%d\n", finalTemp);

  ret = meadow_adc_read_internal_vbat(&rawBatteryMeasurement);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
    return ret;
  }

  ret = meadow_adc_read_internal_cleanup();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
    return ret;
  }

  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not initialized.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Start the conversion
  adc_start();
  
  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

#if defined CONFIG_ADC_TESTS
  // Note to execute the following display adds about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%04d-Error Count:%05d\n", callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // Conversion must have completed. Now copy collected data to user's
  // buffer and return
  memcpy(_userDataBuf, _dmaDataBuf, _adcBufSzBytes);
  return OK;
}
